---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDuplicates
source: html/65d9d47b-2f42-42c8-d220-afa7930c082b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDuplicates Property

Can't paste duplicate types. Only non duplicate types will be pasted.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyDuplicates { get; }
```